notes/rust/rust_bczd.org
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="../../css/worg.css" />
#+TITLE: Rust编程之道

* 历史

Rust的出现主要是用来解决两个难题：
- 很难编写内存安全的代码
- 很难编写线程安全的代码

设计人员对于这门语言的期望
- 必须是更加安全、不易崩溃的，尤其是在操作内存时
- 不需要有垃圾回收这样的系统
- 应该拥有一系列的广泛特效，这些特性之间又不乏一致性。这些特性可以很好地相互协作，从而使该语言更容易编写、维护和调试

设计哲学
- 内存安全
- 零成本抽象
- 实用性

Rust团队维护三个发行分支：稳定版（Stable）、测试版（Beta）和开发版（Nightly）。

Rust商业用户：
#+BEGIN_EXAMPLE
Amazon，使用Rust作为构建工具
Atlassian，在后端实用Rust
Dropbox，在前后端均实用了Rust
Facebook，使用Rust重写了源码管理工具
Google，在Fuchsia项目中部分实用了Rust
Microsoft，在Azure IoT网络上部分使用了Rust
npm，在其核心服务上使用了Rust
RedHat，使用Rust创建了新的存储系统
Reddit，使用Rust处理评论
Twitter，在构建团队中使用Rust
等等
#+END_EXAMPLE

* 语言精要
** Rust语言的基本构成
*** 语言规范
由Rust语言参考（The Rust Reference）和RFC文档共同构成。

**** Rust语言参考
是官方团队维护的一份参考文档，包含了三类内容：
- 对每种语言结构及其用法的描述
- 对内存模型、并发模型、链接、调试等内存的描述
- 影响语言设计的基本原理和参考

**** RFC文档
RFC文档是涵盖了语言特性的设计意图、详细设计、优缺点的完整技术方案。

*** 编译器
Rust是一门静态编译型语言。Rust官方的编译器叫rustc。

rustc有如下特点：
- rustc是跨平台的应用程序
- rustc支持交叉编译
- rustc使用LLVM作为编译器后端
- rustc是用Rust语言开发的，包含在Rust语言源码中
- rustc对Rust源码进行词法语法分析、静态类型检查，最终将代码翻译为LLVM IR

*** 核心库
Rust语言的语法由核心库和标准库共同提供的。其中Rust核心库是标准库的基础。核心库中定义的是Rust语言的核心，不依赖于操作系统和网络等相关的库，甚至不知道堆分配，也不提供并发和I/O。

可以通过在模块顶部引入 *#![no_std]* 来使用核心库。

*做嵌入式应用开发的时候，核心库是必须的*

*** 标准库
标准库包含的内容大概如下：
- 与核心库一样的基本trait、原始数据类型、功能型数据类型和常用宏等，以及与核心库几乎完全一致的API
- 并发、I/O和运行时
- 平台抽象
- 底层操作借口
- 可选和错误处理类型Option和Result，以及各种迭代器
*** 包管理器
把按一定规则组织的多个rs文件编译后得到一个包（Crate）。

Rust社区的公开第三方包都集中在[[https://crates.io][crates.io]]网站上面，它们的文档被自动发布到[[https://docs.rs][docs.rs]]网站上

安装好Rust环境之后，可以直接使用Cargo命令来创建包。
#+BEGIN_EXAMPLE
cargo new bin_crate
cargo new --lib lib_crate

cargo build
cargo run
...
#+END_EXAMPLE
** 语句和表达式
Rust中的语法可以分为两大类：
- 语句（Statement），是指要执行的一些操作和产生副作用的表达式
  - 声明语句（Declaration statement）
  - 表达式语句（Expression statement）
- 表达式（Expression），主要用于计算求值
** 变量与绑定
let创建的变量一般称为绑定（Binding），它表明了标识符（Identifier）和值（Value）之间建立的一种关联关系

*** 位置表达式和值表达式
*** 不可变绑定和可变绑定
使用let关键字声明的位置表达式默认不可变，为不可变绑定。需要加上关键字 *mut* 表示可变绑定
#+BEGIN_SRC rust
fn main(){
    let a = 1;
    // a = 2; // immutable and error
    let mub b = 2;
    b = 3; // mutable
}
#+END_SRC
*** 所有权与引用

#+BEGIN_SRC rust
fn main(){
    let place1 = "place1";
    let place2 = "place2";
    let other1 = place1; // 所有权（OwnerShip）转移，称为移动（Move）语义
    let other2 = &place2; // 引用
    println!("place1 {:p} other1 {:p}",place1,other1);
    println!("place2 {:p} other2 {:p}",place2,*other2);
    assert_eq!(place1,other1);
    assert_eq!(place2,*other2);
}
#+END_SRC

** 函数与闭包
*** 函数定义
函数是通过关键字 *fn* 定义的
*** 作用域与生命周期
Rust语言的作用域是静态作用域，即词法作用域（Lexical Scope）。由一对花括号来开辟作用域，其中用域在词法分析阶段就已经确定了，不会动态改变。

#+BEGIN_SRC rust
fn main(){
    let v = "hello world!";
    assert_eq!(v, "hello world!");
    let v = "hello rust!";
    assert_eq!(v, "hello rust!");
    { // 变量屏蔽（Variable Shadow）
        let v = "hello world!";
        asser_eq!(v, "hello world!");
    }
    assert_eq!(v "hello rust!");
}
#+END_SRC
