notes/rust/rust_bczd.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-01-12 日 17:38 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Rust编程之道</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="shouchengcheng" />
<link rel="stylesheet" type="text/css" href="../../css/worg.css" />
</head>
<body>
<div id="content">
<h1 class="title">Rust编程之道</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgf15082d">1. 历史</a></li>
<li><a href="#org47528a8">2. 语言精要</a>
<ul>
<li><a href="#orgcf9cb1c">2.1. Rust语言的基本构成</a>
<ul>
<li><a href="#org9bb646a">2.1.1. 语言规范</a></li>
<li><a href="#org9b78ff7">2.1.2. 编译器</a></li>
<li><a href="#orgce3a84d">2.1.3. 核心库</a></li>
<li><a href="#org7299fa7">2.1.4. 标准库</a></li>
<li><a href="#orgcb970f6">2.1.5. 包管理器</a></li>
</ul>
</li>
<li><a href="#org7c9076d">2.2. 语句和表达式</a></li>
<li><a href="#org7e0acfd">2.3. 变量与绑定</a>
<ul>
<li><a href="#org98e76d6">2.3.1. 位置表达式和值表达式</a></li>
<li><a href="#orgc2d8952">2.3.2. 不可变绑定和可变绑定</a></li>
<li><a href="#orgaa1a5b4">2.3.3. 所有权与引用</a></li>
</ul>
</li>
<li><a href="#org6abdbdc">2.4. 函数与闭包</a>
<ul>
<li><a href="#org8a552c8">2.4.1. 函数定义</a></li>
<li><a href="#orge950ee8">2.4.2. 作用域与生命周期</a></li>
<li><a href="#orgfc72abd">2.4.3. 函数指针</a></li>
<li><a href="#orgab9608c">2.4.4. CTFE机制</a></li>
<li><a href="#org9265e90">2.4.5. 闭包</a></li>
</ul>
</li>
<li><a href="#orgf46c0e1">2.5. 流程控制</a>
<ul>
<li><a href="#orgf8bd5d2">2.5.1. 条件表达式</a></li>
<li><a href="#org659d4e7">2.5.2. 循环表达式</a></li>
<li><a href="#orge8da6db">2.5.3. match表达式与模式匹配</a></li>
<li><a href="#orgd0a8f24">2.5.4. if let和while let表达式</a></li>
</ul>
</li>
<li><a href="#org86baea2">2.6. 基本数据类型</a></li>
<li><a href="#org7a7af82">2.7. 复合数据类型</a></li>
<li><a href="#orgc37edcd">2.8. 常用集合类型</a></li>
<li><a href="#org8c11f8f">2.9. 智能指针</a></li>
<li><a href="#orga63d480">2.10. 泛型和trait</a></li>
<li><a href="#orge1a21fd">2.11. 错误处理</a></li>
<li><a href="#orge9eb12b">2.12. 表达式优先级</a></li>
<li><a href="#org33dad74">2.13. 注释与打印</a></li>
</ul>
</li>
<li><a href="#org48d5541">3. 类型系统</a>
<ul>
<li><a href="#org3ec82d0">3.1. 通用概念</a>
<ul>
<li><a href="#orgca6f5cb">3.1.1. 类型系统的作用</a></li>
<li><a href="#org5869fa1">3.1.2. 类型系统的分类</a></li>
<li><a href="#org48123fd">3.1.3. 类型系统与多态性</a></li>
</ul>
</li>
<li><a href="#org4416d56">3.2. Rust类型系统概述</a>
<ul>
<li><a href="#org433cc9d">3.2.1. 类型推导</a></li>
</ul>
</li>
<li><a href="#org8b783dd">3.3. 泛型（Generic）</a>
<ul>
<li><a href="#org20a9a75">3.3.1. 泛型函数</a></li>
<li><a href="#orgfe9cff2">3.3.2. 泛型返回值自动推导</a></li>
</ul>
</li>
<li><a href="#org0d03fb1">3.4. 深入trait</a>
<ul>
<li><a href="#orgb9060c6">3.4.1. 接口抽象</a></li>
<li><a href="#orgfa11681">3.4.2. 抽象类型</a></li>
</ul>
</li>
<li><a href="#orge47be58">3.5. 类型转换</a>
<ul>
<li><a href="#org1c2c222">3.5.1. deref解引用</a></li>
<li><a href="#org4327f96">3.5.2. as操作符</a></li>
<li><a href="#org25368e0">3.5.3. From和Into</a></li>
</ul>
</li>
<li><a href="#org3cb02ae">3.6. 当前trait系统的不足</a></li>
</ul>
</li>
<li><a href="#orgcfa870c">4. 内存管理</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgf15082d" class="outline-2">
<h2 id="orgf15082d"><span class="section-number-2">1</span> 历史</h2>
<div class="outline-text-2" id="text-1">
<p>
Rust的出现主要是用来解决两个难题：
</p>
<ul class="org-ul">
<li>很难编写内存安全的代码</li>
<li>很难编写线程安全的代码</li>
</ul>

<p>
设计人员对于这门语言的期望
</p>
<ul class="org-ul">
<li>必须是更加安全、不易崩溃的，尤其是在操作内存时</li>
<li>不需要有垃圾回收这样的系统</li>
<li>应该拥有一系列的广泛特效，这些特性之间又不乏一致性。这些特性可以很好地相互协作，从而使该语言更容易编写、维护和调试</li>
</ul>

<p>
设计哲学
</p>
<ul class="org-ul">
<li>内存安全</li>
<li>零成本抽象</li>
<li>实用性</li>
</ul>

<p>
Rust团队维护三个发行分支：稳定版（Stable）、测试版（Beta）和开发版（Nightly）。
</p>

<p>
Rust商业用户：
</p>
<pre class="example">
Amazon，使用Rust作为构建工具
Atlassian，在后端实用Rust
Dropbox，在前后端均实用了Rust
Facebook，使用Rust重写了源码管理工具
Google，在Fuchsia项目中部分实用了Rust
Microsoft，在Azure IoT网络上部分使用了Rust
npm，在其核心服务上使用了Rust
RedHat，使用Rust创建了新的存储系统
Reddit，使用Rust处理评论
Twitter，在构建团队中使用Rust
等等
</pre>
</div>
</div>

<div id="outline-container-org47528a8" class="outline-2">
<h2 id="org47528a8"><span class="section-number-2">2</span> 语言精要</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-orgcf9cb1c" class="outline-3">
<h3 id="orgcf9cb1c"><span class="section-number-3">2.1</span> Rust语言的基本构成</h3>
<div class="outline-text-3" id="text-2-1">
</div>
<div id="outline-container-org9bb646a" class="outline-4">
<h4 id="org9bb646a"><span class="section-number-4">2.1.1</span> 语言规范</h4>
<div class="outline-text-4" id="text-2-1-1">
<p>
由Rust语言参考（The Rust Reference）和RFC文档共同构成。
</p>
</div>

<ol class="org-ol">
<li><a id="org053fb2c"></a>Rust语言参考<br />
<div class="outline-text-5" id="text-2-1-1-1">
<p>
是官方团队维护的一份参考文档，包含了三类内容：
</p>
<ul class="org-ul">
<li>对每种语言结构及其用法的描述</li>
<li>对内存模型、并发模型、链接、调试等内存的描述</li>
<li>影响语言设计的基本原理和参考</li>
</ul>
</div>
</li>

<li><a id="orgd3f5fd4"></a>RFC文档<br />
<div class="outline-text-5" id="text-2-1-1-2">
<p>
RFC文档是涵盖了语言特性的设计意图、详细设计、优缺点的完整技术方案。
</p>
</div>
</li>
</ol>
</div>

<div id="outline-container-org9b78ff7" class="outline-4">
<h4 id="org9b78ff7"><span class="section-number-4">2.1.2</span> 编译器</h4>
<div class="outline-text-4" id="text-2-1-2">
<p>
Rust是一门静态编译型语言。Rust官方的编译器叫rustc。
</p>

<p>
rustc有如下特点：
</p>
<ul class="org-ul">
<li>rustc是跨平台的应用程序</li>
<li>rustc支持交叉编译</li>
<li>rustc使用LLVM作为编译器后端</li>
<li>rustc是用Rust语言开发的，包含在Rust语言源码中</li>
<li>rustc对Rust源码进行词法语法分析、静态类型检查，最终将代码翻译为LLVM IR</li>
</ul>
</div>
</div>

<div id="outline-container-orgce3a84d" class="outline-4">
<h4 id="orgce3a84d"><span class="section-number-4">2.1.3</span> 核心库</h4>
<div class="outline-text-4" id="text-2-1-3">
<p>
Rust语言的语法由核心库和标准库共同提供的。其中Rust核心库是标准库的基础。核心库中定义的是Rust语言的核心，不依赖于操作系统和网络等相关的库，甚至不知道堆分配，也不提供并发和I/O。
</p>

<p>
可以通过在模块顶部引入 <b>#![no<sub>std</sub>]</b> 来使用核心库。
</p>

<p>
<b>做嵌入式应用开发的时候，核心库是必须的</b>
</p>
</div>
</div>

<div id="outline-container-org7299fa7" class="outline-4">
<h4 id="org7299fa7"><span class="section-number-4">2.1.4</span> 标准库</h4>
<div class="outline-text-4" id="text-2-1-4">
<p>
标准库包含的内容大概如下：
</p>
<ul class="org-ul">
<li>与核心库一样的基本trait、原始数据类型、功能型数据类型和常用宏等，以及与核心库几乎完全一致的API</li>
<li>并发、I/O和运行时</li>
<li>平台抽象</li>
<li>底层操作借口</li>
<li>可选和错误处理类型Option和Result，以及各种迭代器</li>
</ul>
</div>
</div>
<div id="outline-container-orgcb970f6" class="outline-4">
<h4 id="orgcb970f6"><span class="section-number-4">2.1.5</span> 包管理器</h4>
<div class="outline-text-4" id="text-2-1-5">
<p>
把按一定规则组织的多个rs文件编译后得到一个包（Crate）。
</p>

<p>
Rust社区的公开第三方包都集中在<a href="https://crates.io">crates.io</a>网站上面，它们的文档被自动发布到<a href="https://docs.rs">docs.rs</a>网站上
</p>

<p>
安装好Rust环境之后，可以直接使用Cargo命令来创建包。
</p>
<pre class="example">
cargo new bin_crate
cargo new --lib lib_crate

cargo build
cargo run
...
</pre>
</div>
</div>
</div>
<div id="outline-container-org7c9076d" class="outline-3">
<h3 id="org7c9076d"><span class="section-number-3">2.2</span> 语句和表达式</h3>
<div class="outline-text-3" id="text-2-2">
<p>
Rust中的语法可以分为两大类：
</p>
<ul class="org-ul">
<li>语句（Statement），是指要执行的一些操作和产生副作用的表达式
<ul class="org-ul">
<li>声明语句（Declaration statement）</li>
<li>表达式语句（Expression statement）</li>
</ul></li>
<li>表达式（Expression），主要用于计算求值</li>
</ul>
</div>
</div>
<div id="outline-container-org7e0acfd" class="outline-3">
<h3 id="org7e0acfd"><span class="section-number-3">2.3</span> 变量与绑定</h3>
<div class="outline-text-3" id="text-2-3">
<p>
let创建的变量一般称为绑定（Binding），它表明了标识符（Identifier）和值（Value）之间建立的一种关联关系
</p>
</div>

<div id="outline-container-org98e76d6" class="outline-4">
<h4 id="org98e76d6"><span class="section-number-4">2.3.1</span> 位置表达式和值表达式</h4>
</div>
<div id="outline-container-orgc2d8952" class="outline-4">
<h4 id="orgc2d8952"><span class="section-number-4">2.3.2</span> 不可变绑定和可变绑定</h4>
<div class="outline-text-4" id="text-2-3-2">
<p>
使用let关键字声明的位置表达式默认不可变，为不可变绑定。需要加上关键字 <b>mut</b> 表示可变绑定
</p>
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #346604;">fn</span> <span style="color: #a40000;">main</span>(){
    <span style="color: #346604;">let</span> <span style="color: #b35000;">a</span> = 1;
    <span style="color: #5f615c; font-style: italic;">// </span><span style="color: #5f615c; font-style: italic;">a = 2; // immutable and error</span>
    <span style="color: #346604;">let</span> <span style="color: #b35000;">mub</span> b = 2;
    b = 3; <span style="color: #5f615c; font-style: italic;">// </span><span style="color: #5f615c; font-style: italic;">mutable</span>
}
</pre>
</div>
</div>
</div>
<div id="outline-container-orgaa1a5b4" class="outline-4">
<h4 id="orgaa1a5b4"><span class="section-number-4">2.3.3</span> 所有权与引用</h4>
<div class="outline-text-4" id="text-2-3-3">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #346604;">fn</span> <span style="color: #a40000;">main</span>(){
    <span style="color: #346604;">let</span> <span style="color: #b35000;">place1</span> = <span style="color: #5c3566;">"place1"</span>;
    <span style="color: #346604;">let</span> <span style="color: #b35000;">place2</span> = <span style="color: #5c3566;">"place2"</span>;
    <span style="color: #346604;">let</span> <span style="color: #b35000;">other1</span> = place1; <span style="color: #5f615c; font-style: italic;">// </span><span style="color: #5f615c; font-style: italic;">&#25152;&#26377;&#26435;&#65288;OwnerShip&#65289;&#36716;&#31227;&#65292;&#31216;&#20026;&#31227;&#21160;&#65288;Move&#65289;&#35821;&#20041;</span>
    <span style="color: #346604;">let</span> <span style="color: #b35000;">other2</span> = &amp;place2; <span style="color: #5f615c; font-style: italic;">// </span><span style="color: #5f615c; font-style: italic;">&#24341;&#29992;</span>
    <span style="color: #75507b;">println!</span>(<span style="color: #5c3566;">"place1 </span><span style="color: #5c3566; font-style: italic;">{:p}</span><span style="color: #5c3566;"> other1 </span><span style="color: #5c3566; font-style: italic;">{:p}</span><span style="color: #5c3566;">"</span>,place1,other1);
    <span style="color: #75507b;">println!</span>(<span style="color: #5c3566;">"place2 </span><span style="color: #5c3566; font-style: italic;">{:p}</span><span style="color: #5c3566;"> other2 </span><span style="color: #5c3566; font-style: italic;">{:p}</span><span style="color: #5c3566;">"</span>,place2,*other2);
    <span style="color: #75507b;">assert_eq!</span>(place1,other1);
    <span style="color: #75507b;">assert_eq!</span>(place2,*other2);
}
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org6abdbdc" class="outline-3">
<h3 id="org6abdbdc"><span class="section-number-3">2.4</span> 函数与闭包</h3>
<div class="outline-text-3" id="text-2-4">
</div>
<div id="outline-container-org8a552c8" class="outline-4">
<h4 id="org8a552c8"><span class="section-number-4">2.4.1</span> 函数定义</h4>
<div class="outline-text-4" id="text-2-4-1">
<p>
函数是通过关键字 <b>fn</b> 定义的
</p>
</div>
</div>
<div id="outline-container-orge950ee8" class="outline-4">
<h4 id="orge950ee8"><span class="section-number-4">2.4.2</span> 作用域与生命周期</h4>
<div class="outline-text-4" id="text-2-4-2">
<p>
Rust语言的作用域是静态作用域，即词法作用域（Lexical Scope）。由一对花括号来开辟作用域，其中用域在词法分析阶段就已经确定了，不会动态改变。
</p>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #346604;">fn</span> <span style="color: #a40000;">main</span>(){
    <span style="color: #346604;">let</span> <span style="color: #b35000;">v</span> = <span style="color: #5c3566;">"hello world!"</span>;
    <span style="color: #75507b;">assert_eq!</span>(v, <span style="color: #5c3566;">"hello world!"</span>);
    <span style="color: #346604;">let</span> <span style="color: #b35000;">v</span> = <span style="color: #5c3566;">"hello rust!"</span>;
    <span style="color: #75507b;">assert_eq!</span>(v, <span style="color: #5c3566;">"hello rust!"</span>);
    { <span style="color: #5f615c; font-style: italic;">// </span><span style="color: #5f615c; font-style: italic;">&#21464;&#37327;&#23631;&#34109;&#65288;Variable Shadow&#65289;</span>
        <span style="color: #346604;">let</span> <span style="color: #b35000;">v</span> = <span style="color: #5c3566;">"hello world!"</span>;
        <span style="color: #75507b;">asser_eq!</span>(v, <span style="color: #5c3566;">"hello world!"</span>);
    }
    <span style="color: #75507b;">assert_eq!</span>(v <span style="color: #5c3566;">"hello rust!"</span>);
}
</pre>
</div>
</div>
</div>
