notes/rust/rust_bczd.org
*** 函数指针
函数自身可以作为函数的参数和返回值使用
#+BEGIN_SRC rust
pub fn math(op: fn(i32, i32) -> i32, a: i32, b: i32) -> i32 {
    op(a, b)
}

fn sum(a: i32, b: i32) -> i32 {
    a + b
}

fn product(a: i32, b: i32) -> i32 {
    a * b
}

fn main() {
    let a = 2;
    let b = 3;
    assert_eq!(math(sum, a, b), 5);
    assert_eq!(math(product, a, b), 6);
}
#+END_SRC

#+BEGIN_SRC rust
fn is_true() -> bool { true}
fn true_maker() -> fn() -> bool{is_true}
fn main(){
    assert_eq!(true_maker()(), true);
}
#+END_SRC

*** CTFE机制
Rust编译器也可以像C++和D语言那样，拥有编译时函数执行（Compile-Time Function Execution，CTFE）的能力

Rust 2018版本已经集成进去，2015版的时候，需要加 *#![feature (const_fn)]* 特性（使用Nightly版本）
#+BEGIN_SRC rust
const fn init_len() -> usize {
    return 5;
}
fn main(){
    let arr = [0; init_len()];
    // init_len必须在编译期求值，这就是CTFE的能力
}
#+END_SRC

*** 闭包
闭包也叫匿名函数，具有以下特点：
- 可以像函数一样被调用
- 可以捕获上下文环境中的自由变量
- 可以自动推断输入和返回的类型
#+BEGIN_SRC rust
fn main() {
    let out = 42;
    fn add(i: i32, j: i32) -> i32 {
        i + j
    }
    let closure_annotated = |i: i32, j: i32| -> i32 { i + j + out };
    let closure_inferred = |i, j| i + j + out;
    let i = 1;
    let j = 2;
    assert_eq!(3, add(i, j));
    assert_eq!(45, closure_annotated(i, j));
    assert_eq!(45, closure_inferred(i, j));
}
#+END_SRC
闭包和函数有一个重要的区别，那就是闭包可以捕获外部变量，而函数不可以。

闭包作为参数的情况
#+BEGIN_SRC rust
fn closure_math<F:Fn()->i32>(op:F)->i32{
    op()
}

fn main(){
    let a=2;
    let b=3;
    assert_eq!(closure_math(|| a+b),5);
    assert_eq!(closure_math(|| a*b),6);
}
#+END_SRC
closure_math其参数是一个泛型F，并且该泛型受Fn()->i32 trait的限定

闭包作为返回值
#+BEGIN_SRC rust
fn two_times_impl() -> impl Fn(i32) -> i32{
    let i = 2;
    move |j| j*i
}

fn main(){
    let result = two_times_impl();
    assert_eq!(result(2), 4);
}
#+END_SRC
使用move关键字，将捕获变量地所有权转移到闭包中，就不会按引用进行捕获变量，这样闭包才可以安全地返回

** 流程控制
*** 条件表达式
#+BEGIN_SRC rust
fn main(){
    let n = 13;
    let big_n = if (n < 10 && n > -10) {
        10 * n
    }else {
        n / 2 // 因为类型已经是i32，所以小数部分会被编译器截去
    };
    assert_eq!(big_n, 6);
}
#+END_SRC
*** 循环表达式
- while
- loop
- for...in，本质上是一个迭代器
#+BEGIN_SRC rust
fn main() {
    for n in 1..101 {
        if n % 15 == 0 {
            println!("fizzbuzz");
        }else if n % 3 == 0 {
            println!("fizz");
        }else if n % 5 == 0 {
            println!("buzz");
        }else {
            println!("{}", n);
        }
    }
}
#+END_SRC

#+BEGIN_SRC rust
fn while_true(x:i32)->i32{
    while true{
        return x+1;
    }
    x
}

fn main(){
    let y = while_true(5);
    assert_eq!(y,6);
}
#+END_SRC

*** match表达式与模式匹配
#+BEGIN_SRC rust
fn main() {
    let number = 42;
    match number {
        0 => println!("Origin"),
        1...3 => println!("A11"),
        | 5 | 7 | 13 => println!("Bad Luck"),
        n @ 42 => println!("Answer is {}", n), // @可以将模式中的值绑定给一个变量
        _ => println!("Common"),
    }
}
#+END_SRC
