notes/rust/rust_bczd.html
<div id="outline-container-orgfc72abd" class="outline-4">
<h4 id="orgfc72abd"><span class="section-number-4">2.4.3</span> 函数指针</h4>
<div class="outline-text-4" id="text-2-4-3">
<p>
函数自身可以作为函数的参数和返回值使用
</p>
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #346604;">pub</span> <span style="color: #346604;">fn</span> <span style="color: #a40000;">math</span>(<span style="color: #b35000;">op</span>: <span style="color: #346604;">fn</span>(<span style="color: #204a87;">i32</span>, <span style="color: #204a87;">i32</span>) -&gt; <span style="color: #204a87;">i32</span>, <span style="color: #b35000;">a</span>: <span style="color: #204a87;">i32</span>, <span style="color: #b35000;">b</span>: <span style="color: #204a87;">i32</span>) -&gt; <span style="color: #204a87;">i32</span> {
    op(a, b)
}

<span style="color: #346604;">fn</span> <span style="color: #a40000;">sum</span>(<span style="color: #b35000;">a</span>: <span style="color: #204a87;">i32</span>, <span style="color: #b35000;">b</span>: <span style="color: #204a87;">i32</span>) -&gt; <span style="color: #204a87;">i32</span> {
    a + b
}

<span style="color: #346604;">fn</span> <span style="color: #a40000;">product</span>(<span style="color: #b35000;">a</span>: <span style="color: #204a87;">i32</span>, <span style="color: #b35000;">b</span>: <span style="color: #204a87;">i32</span>) -&gt; <span style="color: #204a87;">i32</span> {
    a * b
}

<span style="color: #346604;">fn</span> <span style="color: #a40000;">main</span>() {
    <span style="color: #346604;">let</span> <span style="color: #b35000;">a</span> = 2;
    <span style="color: #346604;">let</span> <span style="color: #b35000;">b</span> = 3;
    <span style="color: #75507b;">assert_eq!</span>(math(sum, a, b), 5);
    <span style="color: #75507b;">assert_eq!</span>(math(product, a, b), 6);
}
</pre>
</div>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #346604;">fn</span> <span style="color: #a40000;">is_true</span>() -&gt; <span style="color: #204a87;">bool</span> { <span style="color: #346604;">true</span>}
<span style="color: #346604;">fn</span> <span style="color: #a40000;">true_maker</span>() -&gt; <span style="color: #346604;">fn</span>() -&gt; <span style="color: #204a87;">bool</span>{is_true}
<span style="color: #346604;">fn</span> <span style="color: #a40000;">main</span>(){
    <span style="color: #75507b;">assert_eq!</span>(true_maker()(), <span style="color: #346604;">true</span>);
}
</pre>
</div>
</div>
</div>

<div id="outline-container-orgab9608c" class="outline-4">
<h4 id="orgab9608c"><span class="section-number-4">2.4.4</span> CTFE机制</h4>
<div class="outline-text-4" id="text-2-4-4">
<p>
Rust编译器也可以像C++和D语言那样，拥有编译时函数执行（Compile-Time Function Execution，CTFE）的能力
</p>

<p>
Rust 2018版本已经集成进去，2015版的时候，需要加 <b>#![feature (const<sub>fn</sub>)]</b> 特性（使用Nightly版本）
</p>
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #346604;">const</span> <span style="color: #346604;">fn</span> <span style="color: #a40000;">init_len</span>() -&gt; <span style="color: #204a87;">usize</span> {
    <span style="color: #346604;">return</span> 5;
}
<span style="color: #346604;">fn</span> <span style="color: #a40000;">main</span>(){
    <span style="color: #346604;">let</span> <span style="color: #b35000;">arr</span> = [0; init_len()];
    <span style="color: #5f615c; font-style: italic;">// </span><span style="color: #5f615c; font-style: italic;">init_len&#24517;&#39035;&#22312;&#32534;&#35793;&#26399;&#27714;&#20540;&#65292;&#36825;&#23601;&#26159;CTFE&#30340;&#33021;&#21147;</span>
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org9265e90" class="outline-4">
<h4 id="org9265e90"><span class="section-number-4">2.4.5</span> 闭包</h4>
<div class="outline-text-4" id="text-2-4-5">
<p>
闭包也叫匿名函数，具有以下特点：
</p>
<ul class="org-ul">
<li>可以像函数一样被调用</li>
<li>可以捕获上下文环境中的自由变量</li>
<li>可以自动推断输入和返回的类型</li>
</ul>
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #346604;">fn</span> <span style="color: #a40000;">main</span>() {
    <span style="color: #346604;">let</span> <span style="color: #b35000;">out</span> = 42;
    <span style="color: #346604;">fn</span> <span style="color: #a40000;">add</span>(<span style="color: #b35000;">i</span>: <span style="color: #204a87;">i32</span>, <span style="color: #b35000;">j</span>: <span style="color: #204a87;">i32</span>) -&gt; <span style="color: #204a87;">i32</span> {
        i + j
    }
    <span style="color: #346604;">let</span> <span style="color: #b35000;">closure_annotated</span> = |<span style="color: #b35000;">i</span>: <span style="color: #204a87;">i32</span>, <span style="color: #b35000;">j</span>: <span style="color: #204a87;">i32</span>| -&gt; <span style="color: #204a87;">i32</span> { i + j + out };
    <span style="color: #346604;">let</span> <span style="color: #b35000;">closure_inferred</span> = |i, j| i + j + out;
    <span style="color: #346604;">let</span> <span style="color: #b35000;">i</span> = 1;
    <span style="color: #346604;">let</span> <span style="color: #b35000;">j</span> = 2;
    <span style="color: #75507b;">assert_eq!</span>(3, add(i, j));
    <span style="color: #75507b;">assert_eq!</span>(45, closure_annotated(i, j));
    <span style="color: #75507b;">assert_eq!</span>(45, closure_inferred(i, j));
}
</pre>
</div>
<p>
闭包和函数有一个重要的区别，那就是闭包可以捕获外部变量，而函数不可以。
</p>

<p>
闭包作为参数的情况
</p>
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #346604;">fn</span> <span style="color: #a40000;">closure_math</span>&lt;<span style="color: #b35000;">F</span>:<span style="color: #204a87;">Fn</span>()-&gt;<span style="color: #204a87;">i32</span>&gt;(<span style="color: #b35000;">op</span>:<span style="color: #204a87;">F</span>)-&gt;<span style="color: #204a87;">i32</span>{
    op()
}

<span style="color: #346604;">fn</span> <span style="color: #a40000;">main</span>(){
    <span style="color: #346604;">let</span> a=2;
    <span style="color: #346604;">let</span> b=3;
    <span style="color: #75507b;">assert_eq!</span>(closure_math(|| a+b),5);
    <span style="color: #75507b;">assert_eq!</span>(closure_math(|| a*b),6);
}
</pre>
</div>
<p>
closure<sub>math其参数是一个泛型F</sub>，并且该泛型受Fn()-&gt;i32 trait的限定
</p>

<p>
闭包作为返回值
</p>
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #346604;">fn</span> <span style="color: #a40000;">two_times_impl</span>() -&gt; <span style="color: #346604;">impl</span> <span style="color: #204a87;">Fn</span>(<span style="color: #204a87;">i32</span>) -&gt; <span style="color: #204a87;">i32</span>{
    <span style="color: #346604;">let</span> <span style="color: #b35000;">i</span> = 2;
    <span style="color: #346604;">move</span> |j| j*i
}

<span style="color: #346604;">fn</span> <span style="color: #a40000;">main</span>(){
    <span style="color: #346604;">let</span> <span style="color: #b35000;">result</span> = two_times_impl();
    <span style="color: #75507b;">assert_eq!</span>(result(2), 4);
}
</pre>
</div>
<p>
使用move关键字，将捕获变量地所有权转移到闭包中，就不会按引用进行捕获变量，这样闭包才可以安全地返回
</p>
</div>
</div>
</div>

<div id="outline-container-orgf46c0e1" class="outline-3">
<h3 id="orgf46c0e1"><span class="section-number-3">2.5</span> 流程控制</h3>
<div class="outline-text-3" id="text-2-5">
</div>
<div id="outline-container-orgf8bd5d2" class="outline-4">
<h4 id="orgf8bd5d2"><span class="section-number-4">2.5.1</span> 条件表达式</h4>
<div class="outline-text-4" id="text-2-5-1">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #346604;">fn</span> <span style="color: #a40000;">main</span>(){
    <span style="color: #346604;">let</span> <span style="color: #b35000;">n</span> = 13;
    <span style="color: #346604;">let</span> <span style="color: #b35000;">big_n</span> = <span style="color: #346604;">if</span> (n &lt; 10 &amp;&amp; n &gt; -10) {
        10 * n
    }<span style="color: #346604;">else</span> {
        n / 2 <span style="color: #5f615c; font-style: italic;">// </span><span style="color: #5f615c; font-style: italic;">&#22240;&#20026;&#31867;&#22411;&#24050;&#32463;&#26159;i32&#65292;&#25152;&#20197;&#23567;&#25968;&#37096;&#20998;&#20250;&#34987;&#32534;&#35793;&#22120;&#25130;&#21435;</span>
    };
    <span style="color: #75507b;">assert_eq!</span>(big_n, 6);
}
</pre>
</div>
</div>
</div>
<div id="outline-container-org659d4e7" class="outline-4">
<h4 id="org659d4e7"><span class="section-number-4">2.5.2</span> 循环表达式</h4>
<div class="outline-text-4" id="text-2-5-2">
<ul class="org-ul">
<li>while</li>
<li>loop</li>
<li>for&#x2026;in，本质上是一个迭代器</li>
</ul>
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #346604;">fn</span> <span style="color: #a40000;">main</span>() {
    <span style="color: #346604;">for</span> <span style="color: #b35000;">n</span> <span style="color: #346604;">in</span> 1..101 {
        <span style="color: #346604;">if</span> n % 15 == 0 {
            <span style="color: #75507b;">println!</span>(<span style="color: #5c3566;">"fizzbuzz"</span>);
        }<span style="color: #346604;">else</span> <span style="color: #346604;">if</span> n % 3 == 0 {
            <span style="color: #75507b;">println!</span>(<span style="color: #5c3566;">"fizz"</span>);
        }<span style="color: #346604;">else</span> <span style="color: #346604;">if</span> n % 5 == 0 {
            <span style="color: #75507b;">println!</span>(<span style="color: #5c3566;">"buzz"</span>);
        }<span style="color: #346604;">else</span> {
            <span style="color: #75507b;">println!</span>(<span style="color: #5c3566;">"</span><span style="color: #5c3566; font-style: italic;">{}</span><span style="color: #5c3566;">"</span>, n);
        }
    }
}
</pre>
</div>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #346604;">fn</span> <span style="color: #a40000;">while_true</span>(<span style="color: #b35000;">x</span>:<span style="color: #204a87;">i32</span>)-&gt;<span style="color: #204a87;">i32</span>{
    <span style="color: #346604;">while</span> <span style="color: #346604;">true</span>{
        <span style="color: #346604;">return</span> x+1;
    }
    x
}

<span style="color: #346604;">fn</span> <span style="color: #a40000;">main</span>(){
    <span style="color: #346604;">let</span> <span style="color: #b35000;">y</span> = while_true(5);
    <span style="color: #75507b;">assert_eq!</span>(y,6);
}
</pre>
</div>
</div>
</div>

<div id="outline-container-orge8da6db" class="outline-4">
<h4 id="orge8da6db"><span class="section-number-4">2.5.3</span> match表达式与模式匹配</h4>
<div class="outline-text-4" id="text-2-5-3">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #346604;">fn</span> <span style="color: #a40000;">main</span>() {
    <span style="color: #346604;">let</span> <span style="color: #b35000;">number</span> = 42;
    <span style="color: #346604;">match</span> number {
        0 =&gt; <span style="color: #75507b;">println!</span>(<span style="color: #5c3566;">"Origin"</span>),
        1...3 =&gt; <span style="color: #75507b;">println!</span>(<span style="color: #5c3566;">"A11"</span>),
        | 5 | 7 | 13 =&gt; <span style="color: #75507b;">println!</span>(<span style="color: #5c3566;">"Bad Luck"</span>),
        n @ 42 =&gt; <span style="color: #75507b;">println!</span>(<span style="color: #5c3566;">"Answer is </span><span style="color: #5c3566; font-style: italic;">{}</span><span style="color: #5c3566;">"</span>, n), <span style="color: #5f615c; font-style: italic;">// </span><span style="color: #5f615c; font-style: italic;">@&#21487;&#20197;&#23558;&#27169;&#24335;&#20013;&#30340;&#20540;&#32465;&#23450;&#32473;&#19968;&#20010;&#21464;&#37327;</span>
        _ =&gt; <span style="color: #75507b;">println!</span>(<span style="color: #5c3566;">"Common"</span>),
    }
}
</pre>
</div>
</div>
</div>
