notes/rust/rust_bczd.org
*** if let和while let表达式
使用if let表达式
#+BEGIN_SRC rust
fn main(){
    let boolean = true;
    let mut binary = 0;
    if let true = boolean {
        binary = 1;
    }
    assert_eq!(binary, 1);
}
#+END_SRC

使用match表达式
#+BEGIN_SRC rust
fn main(){
    let mut v = vec![1,2,3,4,5];
    loop {
        match v.pop() {
            Some(x) => println!("{}", x),
            None => break, // 跳出循环
        }
    }
}
#+END_SRC

使用while let表达式
#+BEGIN_SRC rust
fn main() {
    let mut v = vec![1,2,3,4,5];
    while let Some(x) = v.pop() {
        println!("{}", x);
    }
}
#+END_SRC

** 基本数据类型
- 布尔类型
  - bool（true,false）
- 基本数字类型
  - 固定大小
    - u8,u16,u32,u64,u128
    - i8,i16,i32,i64,i128
  - 动态大小，取决于机器的字长
    - usize
    - isize
  - 浮点数
    - f32,f64
- 字符类型，Char
- 数组类型，Array，数组的特点
  - 数组大小固定
  - 元素均为同类型
  - 默认不可变
- 范围类型，Range
  - 1..5 => [1,5) => 1,2,3,4
  - 1..=5 => [1,5] => 1,2,3,4,5
- 切片类型，Slice，用[T]类型表示连续序列，那么切片类型就是&[T]和&mut[T]
- str字符串类型
- 指针，可以表示内存地址的类型称为指针
  - 引用（Reference）
  - 原生指针（Raw Pointer），主要用于Unsafe Rust中
  - 函数指针（fn Pointer）
  - 智能指针（Smart Pointer）

原生指针实例
#+BEGIN_SRC rust
fn main() {
    let mut x = 10;
    let ptr_x = &mut x as *mut i32;
    let y = Box::new(20);
    let ptr_y = &*y as *const i32;
    unsafe {
        *ptr_x += *ptr_y;
    }
    assert_eq!(x, 30);
}
#+END_SRC

** 复合数据类型
- 元组（Tuple），是一种异构有限序列，形如（T,U,M,N)
- 结构体（Struct）
  - 具名结构体（Named-Field Struct）
  - 元组结构体（Tuple-Like Struct）
  - 单元结构体（Unit-Like Struct）
- 枚举体（Enum）
  - 无参数枚举体
  - 类C枚举体
  - 携带类型参数的枚举体
- 联合体（Union）
** 常用集合类型
Rust标准库std::collections模块下有4种通用集合类型
- 线性序列
  - 向量（Vec）
  - 双端队列（VecDeque）
  - 链表（LinkedList）
- Key-Value映射表
  - 无序哈希表（HashMap）
  - 有序哈希表（BTreeMap）
- 集合类型
  - 无序集合（HashSet）
  - 有序集合（BTreeSet）
- 优先队列
  - 二叉堆（BinaryHeap）
** 智能指针
它源自C++，Rust将其引入，并使之成为Rust语言中最重要的一种数据结构。

Box<T>是指向类型为T的堆内存分配值的智能指针。当Box<T>超出作用域范围时，将调用其析构函数，销毁内部对象，并自动释放堆中的内存。

Box<T>在堆内存中分配值的实例：
#+BEGIN_SRC rust
fn main() {
    #[derive(PartialEq,Debug)]
    struct Point {
        x:f64,
        y:f64,
    }
    let box_point = Box::new(Point{x:0.0,y:0.0});
    let unboxed_point:Point = *box_point;
    assert_eq!(unboxed_point, Point{x:0.0,y:0.0});
}
#+END_SRC
** 泛型和trait
Rust标准库中定义了很多泛型类型，包括Option<T>、Vec<T>、HashMap<K,V>以及Box<T>等。

trait是借鉴了Haskell的Typeclass。trait是对类型行为的抽象。
- trait是Rust唯一的接口抽象方式
- 可以静态生成，也可以动态调用
- 可以当作标记类型拥有某些特定行为的标签来使用

trait实例：
#+BEGIN_SRC rust
struct Duck;
struct Pig;

trait Fly{
    fn fly(&self)->bool;
}

impl Fly for Duck {
    fn fly(&self) ->bool {
        return true;
    }
}
impl Fly for Pig {
    fn fly(&self) ->bool {
        return false;
    }
}

fn fly_static<T:Fly>(s:T)->bool {
    s.fly()
}
fn fly_dyn(s:&Fly)->bool {
    s.fly()
}

fn main() {
    let pig = Pig;
    assert_eq!(fly_static::<Pig>(pig),false);
    let duck = Duck;
    assert_eq!(fly_static::<Duck>(duck),true);
    assert_eq!(fly_dyn(&Pig),false);
    assert_eq!(fly_dyn(&Duck),true);
}
#+END_SRC

实现Debug trait
#+BEGIN_SRC rust
use std::fmt::*;
struct Point {
    x:i32,
    y:i32,
}
impl Debug for Point {
    fn fmt(&self, f: &mut Formatter) -> Result {
        write!(f, "Point {{x: {}, y: {}}}", self.x, self.y)
    }
}
fn main() {
    let origin = Point {x:0,y:0};
    println!("The origin is: {:?}", origin);
}
#+END_SRC
