notes/rust/rust_bczd.html
<div id="outline-container-orgd0a8f24" class="outline-4">
<h4 id="orgd0a8f24"><span class="section-number-4">2.5.4</span> if let和while let表达式</h4>
<div class="outline-text-4" id="text-2-5-4">
<p>
使用if let表达式
</p>
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #346604;">fn</span> <span style="color: #a40000;">main</span>(){
    <span style="color: #346604;">let</span> <span style="color: #b35000;">boolean</span> = <span style="color: #346604;">true</span>;
    <span style="color: #346604;">let</span> <span style="color: #346604;">mut</span> <span style="color: #b35000;">binary</span> = 0;
    <span style="color: #346604;">if</span> <span style="color: #346604;">let</span> <span style="color: #346604;">true</span> = boolean {
        binary = 1;
    }
    <span style="color: #75507b;">assert_eq!</span>(binary, 1);
}
</pre>
</div>

<p>
使用match表达式
</p>
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #346604;">fn</span> <span style="color: #a40000;">main</span>(){
    <span style="color: #346604;">let</span> <span style="color: #346604;">mut</span> <span style="color: #b35000;">v</span> = <span style="color: #75507b;">vec!</span>[1,2,3,4,5];
    <span style="color: #346604;">loop</span> {
        <span style="color: #346604;">match</span> v.pop() {
            <span style="color: #204a87;">Some</span>(x) =&gt; <span style="color: #75507b;">println!</span>(<span style="color: #5c3566;">"</span><span style="color: #5c3566; font-style: italic;">{}</span><span style="color: #5c3566;">"</span>, x),
            <span style="color: #204a87;">None</span> =&gt; <span style="color: #346604;">break</span>, <span style="color: #5f615c; font-style: italic;">// </span><span style="color: #5f615c; font-style: italic;">&#36339;&#20986;&#24490;&#29615;</span>
        }
    }
}
</pre>
</div>

<p>
使用while let表达式
</p>
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #346604;">fn</span> <span style="color: #a40000;">main</span>() {
    <span style="color: #346604;">let</span> <span style="color: #346604;">mut</span> <span style="color: #b35000;">v</span> = <span style="color: #75507b;">vec!</span>[1,2,3,4,5];
    <span style="color: #346604;">while</span> <span style="color: #346604;">let</span> <span style="color: #204a87;">Some</span>(x) = v.pop() {
        <span style="color: #75507b;">println!</span>(<span style="color: #5c3566;">"</span><span style="color: #5c3566; font-style: italic;">{}</span><span style="color: #5c3566;">"</span>, x);
    }
}
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org86baea2" class="outline-3">
<h3 id="org86baea2"><span class="section-number-3">2.6</span> 基本数据类型</h3>
<div class="outline-text-3" id="text-2-6">
<ul class="org-ul">
<li>布尔类型
<ul class="org-ul">
<li>bool（true,false）</li>
</ul></li>
<li>基本数字类型
<ul class="org-ul">
<li>固定大小
<ul class="org-ul">
<li>u8,u16,u32,u64,u128</li>
<li>i8,i16,i32,i64,i128</li>
</ul></li>
<li>动态大小，取决于机器的字长
<ul class="org-ul">
<li>usize</li>
<li>isize</li>
</ul></li>
<li>浮点数
<ul class="org-ul">
<li>f32,f64</li>
</ul></li>
</ul></li>
<li>字符类型，Char</li>
<li>数组类型，Array，数组的特点
<ul class="org-ul">
<li>数组大小固定</li>
<li>元素均为同类型</li>
<li>默认不可变</li>
</ul></li>
<li>范围类型，Range
<ul class="org-ul">
<li>1..5 =&gt; [1,5) =&gt; 1,2,3,4</li>
<li>1..=5 =&gt; [1,5] =&gt; 1,2,3,4,5</li>
</ul></li>
<li>切片类型，Slice，用[T]类型表示连续序列，那么切片类型就是&amp;[T]和&amp;mut[T]</li>
<li>str字符串类型</li>
<li>指针，可以表示内存地址的类型称为指针
<ul class="org-ul">
<li>引用（Reference）</li>
<li>原生指针（Raw Pointer），主要用于Unsafe Rust中</li>
<li>函数指针（fn Pointer）</li>
<li>智能指针（Smart Pointer）</li>
</ul></li>
</ul>

<p>
原生指针实例
</p>
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #346604;">fn</span> <span style="color: #a40000;">main</span>() {
    <span style="color: #346604;">let</span> <span style="color: #346604;">mut</span> <span style="color: #b35000;">x</span> = 10;
    <span style="color: #346604;">let</span> <span style="color: #b35000;">ptr_x</span> = &amp;<span style="color: #346604;">mut</span> x <span style="color: #346604;">as</span> *<span style="color: #346604;">mut</span> <span style="color: #204a87;">i32</span>;
    <span style="color: #346604;">let</span> <span style="color: #b35000;">y</span> = <span style="color: #204a87;">Box</span>::new(20);
    <span style="color: #346604;">let</span> <span style="color: #b35000;">ptr_y</span> = &amp;*y <span style="color: #346604;">as</span> *<span style="color: #346604;">const</span> <span style="color: #204a87;">i32</span>;
    <span style="color: #a40000;">unsafe</span> {
        *ptr_x += *ptr_y;
    }
    <span style="color: #75507b;">assert_eq!</span>(x, 30);
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org7a7af82" class="outline-3">
<h3 id="org7a7af82"><span class="section-number-3">2.7</span> 复合数据类型</h3>
<div class="outline-text-3" id="text-2-7">
<ul class="org-ul">
<li>元组（Tuple），是一种异构有限序列，形如（T,U,M,N)</li>
<li>结构体（Struct）
<ul class="org-ul">
<li>具名结构体（Named-Field Struct）</li>
<li>元组结构体（Tuple-Like Struct）</li>
<li>单元结构体（Unit-Like Struct）</li>
</ul></li>
<li>枚举体（Enum）
<ul class="org-ul">
<li>无参数枚举体</li>
<li>类C枚举体</li>
<li>携带类型参数的枚举体</li>
</ul></li>
<li>联合体（Union）</li>
</ul>
</div>
</div>
<div id="outline-container-orgc37edcd" class="outline-3">
<h3 id="orgc37edcd"><span class="section-number-3">2.8</span> 常用集合类型</h3>
<div class="outline-text-3" id="text-2-8">
<p>
Rust标准库std::collections模块下有4种通用集合类型
</p>
<ul class="org-ul">
<li>线性序列
<ul class="org-ul">
<li>向量（Vec）</li>
<li>双端队列（VecDeque）</li>
<li>链表（LinkedList）</li>
</ul></li>
<li>Key-Value映射表
<ul class="org-ul">
<li>无序哈希表（HashMap）</li>
<li>有序哈希表（BTreeMap）</li>
</ul></li>
<li>集合类型
<ul class="org-ul">
<li>无序集合（HashSet）</li>
<li>有序集合（BTreeSet）</li>
</ul></li>
<li>优先队列
<ul class="org-ul">
<li>二叉堆（BinaryHeap）</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org8c11f8f" class="outline-3">
<h3 id="org8c11f8f"><span class="section-number-3">2.9</span> 智能指针</h3>
<div class="outline-text-3" id="text-2-9">
<p>
它源自C++，Rust将其引入，并使之成为Rust语言中最重要的一种数据结构。
</p>

<p>
Box&lt;T&gt;是指向类型为T的堆内存分配值的智能指针。当Box&lt;T&gt;超出作用域范围时，将调用其析构函数，销毁内部对象，并自动释放堆中的内存。
</p>

<p>
Box&lt;T&gt;在堆内存中分配值的实例：
</p>
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #346604;">fn</span> <span style="color: #a40000;">main</span>() {
    <span style="color: #75507b;">#[derive(PartialEq,Debug)]</span>
    <span style="color: #346604;">struct</span> <span style="color: #204a87;">Point</span> {
        <span style="color: #b35000;">x</span>:<span style="color: #204a87;">f64</span>,
        <span style="color: #b35000;">y</span>:<span style="color: #204a87;">f64</span>,
    }
    <span style="color: #346604;">let</span> <span style="color: #b35000;">box_point</span> = <span style="color: #204a87;">Box</span>::new(<span style="color: #204a87;">Point</span>{<span style="color: #b35000;">x</span>:0.0,<span style="color: #b35000;">y</span>:0.0});
    <span style="color: #346604;">let</span> <span style="color: #b35000;">unboxed_point</span>:<span style="color: #204a87;">Point</span> = *box_point;
    <span style="color: #75507b;">assert_eq!</span>(unboxed_point, <span style="color: #204a87;">Point</span>{<span style="color: #b35000;">x</span>:0.0,<span style="color: #b35000;">y</span>:0.0});
}
</pre>
</div>
</div>
</div>
<div id="outline-container-orga63d480" class="outline-3">
<h3 id="orga63d480"><span class="section-number-3">2.10</span> 泛型和trait</h3>
<div class="outline-text-3" id="text-2-10">
<p>
Rust标准库中定义了很多泛型类型，包括Option&lt;T&gt;、Vec&lt;T&gt;、HashMap&lt;K,V&gt;以及Box&lt;T&gt;等。
</p>

<p>
trait是借鉴了Haskell的Typeclass。trait是对类型行为的抽象。
</p>
<ul class="org-ul">
<li>trait是Rust唯一的接口抽象方式</li>
<li>可以静态生成，也可以动态调用</li>
<li>可以当作标记类型拥有某些特定行为的标签来使用</li>
</ul>

<p>
trait实例：
</p>
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #346604;">struct</span> <span style="color: #204a87;">Duck</span>;
<span style="color: #346604;">struct</span> <span style="color: #204a87;">Pig</span>;

<span style="color: #346604;">trait</span> <span style="color: #204a87;">Fly</span>{
    <span style="color: #346604;">fn</span> <span style="color: #a40000;">fly</span>(&amp;<span style="color: #346604;">self</span>)-&gt;<span style="color: #204a87;">bool</span>;
}

<span style="color: #346604;">impl</span> <span style="color: #204a87;">Fly</span> <span style="color: #346604;">for</span> <span style="color: #204a87;">Duck</span> {
    <span style="color: #346604;">fn</span> <span style="color: #a40000;">fly</span>(&amp;<span style="color: #346604;">self</span>) -&gt;<span style="color: #204a87;">bool</span> {
        <span style="color: #346604;">return</span> <span style="color: #346604;">true</span>;
    }
}
<span style="color: #346604;">impl</span> <span style="color: #204a87;">Fly</span> <span style="color: #346604;">for</span> <span style="color: #204a87;">Pig</span> {
    <span style="color: #346604;">fn</span> <span style="color: #a40000;">fly</span>(&amp;<span style="color: #346604;">self</span>) -&gt;<span style="color: #204a87;">bool</span> {
        <span style="color: #346604;">return</span> <span style="color: #346604;">false</span>;
    }
}

<span style="color: #346604;">fn</span> <span style="color: #a40000;">fly_static</span>&lt;<span style="color: #b35000;">T</span>:<span style="color: #204a87;">Fly</span>&gt;(<span style="color: #b35000;">s</span>:<span style="color: #204a87;">T</span>)-&gt;<span style="color: #204a87;">bool</span> {
    s.fly()
}
<span style="color: #346604;">fn</span> <span style="color: #a40000;">fly_dyn</span>(<span style="color: #b35000;">s</span>:&amp;<span style="color: #204a87;">Fly</span>)-&gt;<span style="color: #204a87;">bool</span> {
    s.fly()
}

<span style="color: #346604;">fn</span> <span style="color: #a40000;">main</span>() {
    <span style="color: #346604;">let</span> <span style="color: #b35000;">pig</span> = <span style="color: #204a87;">Pig</span>;
    <span style="color: #75507b;">assert_eq!</span>(fly_static::&lt;<span style="color: #204a87;">Pig</span>&gt;(pig),<span style="color: #346604;">false</span>);
    <span style="color: #346604;">let</span> <span style="color: #b35000;">duck</span> = <span style="color: #204a87;">Duck</span>;
    <span style="color: #75507b;">assert_eq!</span>(fly_static::&lt;<span style="color: #204a87;">Duck</span>&gt;(duck),<span style="color: #346604;">true</span>);
    <span style="color: #75507b;">assert_eq!</span>(fly_dyn(&amp;<span style="color: #204a87;">Pig</span>),<span style="color: #346604;">false</span>);
    <span style="color: #75507b;">assert_eq!</span>(fly_dyn(&amp;<span style="color: #204a87;">Duck</span>),<span style="color: #346604;">true</span>);
}
</pre>
</div>

<p>
实现Debug trait
</p>
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #346604;">use</span> <span style="color: #204a87; font-weight: bold;">std</span>::<span style="color: #204a87; font-weight: bold;">fmt</span>::*;
<span style="color: #346604;">struct</span> <span style="color: #204a87;">Point</span> {
    <span style="color: #b35000;">x</span>:<span style="color: #204a87;">i32</span>,
    <span style="color: #b35000;">y</span>:<span style="color: #204a87;">i32</span>,
}
<span style="color: #346604;">impl</span> <span style="color: #204a87;">Debug</span> <span style="color: #346604;">for</span> <span style="color: #204a87;">Point</span> {
    <span style="color: #346604;">fn</span> <span style="color: #a40000;">fmt</span>(&amp;<span style="color: #346604;">self</span>, <span style="color: #b35000;">f</span>: &amp;<span style="color: #346604;">mut</span> <span style="color: #204a87;">Formatter</span>) -&gt; <span style="color: #204a87;">Result</span> {
        <span style="color: #75507b;">write!</span>(f, <span style="color: #5c3566;">"Point {{x: </span><span style="color: #5c3566; font-style: italic;">{}</span><span style="color: #5c3566;">, y: </span><span style="color: #5c3566; font-style: italic;">{}</span><span style="color: #5c3566;">}}"</span>, <span style="color: #346604;">self</span>.x, <span style="color: #346604;">self</span>.y)
    }
}
<span style="color: #346604;">fn</span> <span style="color: #a40000;">main</span>() {
    <span style="color: #346604;">let</span> <span style="color: #b35000;">origin</span> = <span style="color: #204a87;">Point</span> {<span style="color: #b35000;">x</span>:0,<span style="color: #b35000;">y</span>:0};
    <span style="color: #75507b;">println!</span>(<span style="color: #5c3566;">"The origin is: </span><span style="color: #5c3566; font-style: italic;">{:?}</span><span style="color: #5c3566;">"</span>, origin);
}
</pre>
</div>
</div>
</div>
