notes/rust/rust_bczd.org
** 错误处理
Rust中的错误处理是通过返回Result<T,E>类型的方式进行的。Result<T,E>类型是Option<T>类型的升级版本，同样定义于标准库中。

#+BEGIN_SRC rust
fn main() {
    let x:Result<i32, &str> = Ok(-3);
    assert_eq!(x.is_ok(), true);
    let x:Result<i32, &str> = Err("Some error message");
    assert_eq!(x.is_ok(), false);
}
#+END_SRC

** 表达式优先级
略
** 注释与打印
- 普通的注释
  - 使用//对整行注释
  - 使用/*...*/对区块注释
- 文档注释，内部支持Markdown标记，也支持对文档中的示例代码进行测试，可以使用rustdoc工具生成HTML文档
  - 使用///注释可以生成库文档，一般用于函数或结构体的说明，置于说明对象的上方
  - 使用//!也可以生成库文档，一般用于说明整个模块的功能，置于模块文件的头部

println!宏中的格式化形式列表：
- nothing代表Display，println!("{}",2)
- ?代表Debug，println!("{:?}",2)
- o代表八进制，println!("{:o}",2)
- x代表十六进制，println!("{:x}",2)
- X代表十六进制大写，println!("{:X}",2)
- p代表指针，println!("{:p}",2)
- b代表二进制，println!("{:b}",2)
- e代表指数小写，println!("{:e}",2)
- E代表指数大写，println!("{:E}",2)
* 类型系统
** 通用概念
所谓类型，其实就是对表示信息的值进行的细粒度的区分。
*** 类型系统的作用
类型系统的优势
- 排查错误
- 抽象
- 文档
- 优化效率
- 类型安全
  - 类型安全的语言可以避免类型间的无效计算
  - 类型安全的语言还可以保证内存安全，避免诸如空指针、悬垂指针和缓存区溢出等导致的内存安全问题
  - 类型安全的语言也可以避免语义上的逻辑错误
*** 类型系统的分类
在编译期进行类型检查的语言属于静态类型，在运行期进行类型检查的语言属于动态类型。如果一门语言不允许类型的自动隐式转换，在强制转换前不同类型无法进行计算，则该语言属于强类型，反之则属于弱类型。

*** 类型系统与多态性
如果一个类型系统允许一段代码在不同的上下文中具有不同的类型，这样的类型系统就叫作多态类型系统。

现代编程语言包含三种多态形式：
- 参数化多态（Parametric polymorphism）
- Ad-hoc多态（Ad-hoc polymorphism）
- 子类型多态（Subtype polymorphism）

按多态发生时间来划分：
- 静多态（Static polymorphism）
- 动多态（Dynamic polymorphism）

Rust同时支持静多态和动多态，静多态就是一种零成本的抽象。
** Rust类型系统概述
*** 类型推导

类型推导
#+BEGIN_SRC rust
fn sum(a:u32, b:i32) -> u32 {
    a + (b as u32)
}
fn main() {
    let a = 1;
    let b = 2;
    assert_eq!(sum(a,b),3);
    let elem = 5u8;
    let mut vec = Vec::new();
    vec.push(elem);
    assert_eq!(vec, [5]);
}
#+END_SRC
** 泛型（Generic）
泛型是一种参数化多态
*** 泛型函数
#+BEGIN_SRC rust
fn foo<T>(x:T) -> T {
    return x;
}
fn main() {
    assert_eq!(foo(1),1);
    assert_eq!(foo("hello"),"hello");
}
#+END_SRC

编译期单态化的泛型函数
#+BEGIN_SRC rust
fn foo_1(x: i32) -> i32 {
    return x;
}

fn foo_2(x: &'static str) -> &'static str {
    return x;
}

fn main() {
    foo_1(1);
    foo_2("2");
}
#+END_SRC
单态化静态分发的好处是性能好，没有运行时开销；缺点是容易造成编译后生成的二进制文件膨胀。
*** 泛型返回值自动推导
#+BEGIN_SRC rust
#[derive(Debug, PartialEq)]
struct Foo(i32);
#[derive(Debug, PartialEq)]
struct Bar(i32, i32);
trait Inst {
    fn new(i: i32)-> Self;
}

impl Inst for Foo {
    fn new(i: i32) -> Foo {
        Foo(i)
    }
}
impl Inst for Bar {
    fn new(i: i32) -> Bar {
        Bar(i, i+10)
    }
}
fn foobar<T: Inst>(i: i32) -> T{
    T::new(i)
}
fn main() {
    let f: Foo = foobar(10);
    assert_eq!(f, Foo(10));
    let b: Bar = foobar(20);
    assert_eq!(b, Bar(20, 30));
}
#+END_SRC
** 深入trait
从类型系统的角度来说，trait是Rust对Ad-hoc多态的支持。

从语义上来说，trait是在行为上对类型的约束，这种约束可以让trait有如下4种用法：
- 接口抽象
- 泛型约束
- 抽象类型
- 标签trait
