notes/rust/rust_bczd.html
<div id="outline-container-orge1a21fd" class="outline-3">
<h3 id="orge1a21fd"><span class="section-number-3">2.11</span> 错误处理</h3>
<div class="outline-text-3" id="text-2-11">
<p>
Rust中的错误处理是通过返回Result&lt;T,E&gt;类型的方式进行的。Result&lt;T,E&gt;类型是Option&lt;T&gt;类型的升级版本，同样定义于标准库中。
</p>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #346604;">fn</span> <span style="color: #a40000;">main</span>() {
    <span style="color: #346604;">let</span> <span style="color: #b35000;">x</span>:<span style="color: #204a87;">Result</span>&lt;<span style="color: #204a87;">i32</span>, &amp;<span style="color: #204a87;">str</span>&gt; = <span style="color: #204a87;">Ok</span>(-3);
    <span style="color: #75507b;">assert_eq!</span>(x.is_ok(), <span style="color: #346604;">true</span>);
    <span style="color: #346604;">let</span> <span style="color: #b35000;">x</span>:<span style="color: #204a87;">Result</span>&lt;<span style="color: #204a87;">i32</span>, &amp;<span style="color: #204a87;">str</span>&gt; = <span style="color: #204a87;">Err</span>(<span style="color: #5c3566;">"Some error message"</span>);
    <span style="color: #75507b;">assert_eq!</span>(x.is_ok(), <span style="color: #346604;">false</span>);
}
</pre>
</div>
</div>
</div>

<div id="outline-container-orge9eb12b" class="outline-3">
<h3 id="orge9eb12b"><span class="section-number-3">2.12</span> 表达式优先级</h3>
<div class="outline-text-3" id="text-2-12">
<p>
略
</p>
</div>
</div>
<div id="outline-container-org33dad74" class="outline-3">
<h3 id="org33dad74"><span class="section-number-3">2.13</span> 注释与打印</h3>
<div class="outline-text-3" id="text-2-13">
<ul class="org-ul">
<li>普通的注释
<ul class="org-ul">
<li>使用//对整行注释</li>
<li>使用/*&#x2026;*/对区块注释</li>
</ul></li>
<li>文档注释，内部支持Markdown标记，也支持对文档中的示例代码进行测试，可以使用rustdoc工具生成HTML文档
<ul class="org-ul">
<li>使用///注释可以生成库文档，一般用于函数或结构体的说明，置于说明对象的上方</li>
<li>使用//!也可以生成库文档，一般用于说明整个模块的功能，置于模块文件的头部</li>
</ul></li>
</ul>

<p>
println!宏中的格式化形式列表：
</p>
<ul class="org-ul">
<li>nothing代表Display，println!("{}",2)</li>
<li>?代表Debug，println!("{:?}",2)</li>
<li>o代表八进制，println!("{:o}",2)</li>
<li>x代表十六进制，println!("{:x}",2)</li>
<li>X代表十六进制大写，println!("{:X}",2)</li>
<li>p代表指针，println!("{:p}",2)</li>
<li>b代表二进制，println!("{:b}",2)</li>
<li>e代表指数小写，println!("{:e}",2)</li>
<li>E代表指数大写，println!("{:E}",2)</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org48d5541" class="outline-2">
<h2 id="org48d5541"><span class="section-number-2">3</span> 类型系统</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-org3ec82d0" class="outline-3">
<h3 id="org3ec82d0"><span class="section-number-3">3.1</span> 通用概念</h3>
<div class="outline-text-3" id="text-3-1">
<p>
所谓类型，其实就是对表示信息的值进行的细粒度的区分。
</p>
</div>
<div id="outline-container-orgca6f5cb" class="outline-4">
<h4 id="orgca6f5cb"><span class="section-number-4">3.1.1</span> 类型系统的作用</h4>
<div class="outline-text-4" id="text-3-1-1">
<p>
类型系统的优势
</p>
<ul class="org-ul">
<li>排查错误</li>
<li>抽象</li>
<li>文档</li>
<li>优化效率</li>
<li>类型安全
<ul class="org-ul">
<li>类型安全的语言可以避免类型间的无效计算</li>
<li>类型安全的语言还可以保证内存安全，避免诸如空指针、悬垂指针和缓存区溢出等导致的内存安全问题</li>
<li>类型安全的语言也可以避免语义上的逻辑错误</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org5869fa1" class="outline-4">
<h4 id="org5869fa1"><span class="section-number-4">3.1.2</span> 类型系统的分类</h4>
<div class="outline-text-4" id="text-3-1-2">
<p>
在编译期进行类型检查的语言属于静态类型，在运行期进行类型检查的语言属于动态类型。如果一门语言不允许类型的自动隐式转换，在强制转换前不同类型无法进行计算，则该语言属于强类型，反之则属于弱类型。
</p>
</div>
</div>

<div id="outline-container-org48123fd" class="outline-4">
<h4 id="org48123fd"><span class="section-number-4">3.1.3</span> 类型系统与多态性</h4>
<div class="outline-text-4" id="text-3-1-3">
<p>
如果一个类型系统允许一段代码在不同的上下文中具有不同的类型，这样的类型系统就叫作多态类型系统。
</p>

<p>
现代编程语言包含三种多态形式：
</p>
<ul class="org-ul">
<li>参数化多态（Parametric polymorphism）</li>
<li>Ad-hoc多态（Ad-hoc polymorphism）</li>
<li>子类型多态（Subtype polymorphism）</li>
</ul>

<p>
按多态发生时间来划分：
</p>
<ul class="org-ul">
<li>静多态（Static polymorphism）</li>
<li>动多态（Dynamic polymorphism）</li>
</ul>

<p>
Rust同时支持静多态和动多态，静多态就是一种零成本的抽象。
</p>
</div>
</div>
</div>
<div id="outline-container-org4416d56" class="outline-3">
<h3 id="org4416d56"><span class="section-number-3">3.2</span> Rust类型系统概述</h3>
<div class="outline-text-3" id="text-3-2">
</div>
<div id="outline-container-org433cc9d" class="outline-4">
<h4 id="org433cc9d"><span class="section-number-4">3.2.1</span> 类型推导</h4>
<div class="outline-text-4" id="text-3-2-1">
<p>
类型推导
</p>
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #346604;">fn</span> <span style="color: #a40000;">sum</span>(<span style="color: #b35000;">a</span>:<span style="color: #204a87;">u32</span>, <span style="color: #b35000;">b</span>:<span style="color: #204a87;">i32</span>) -&gt; <span style="color: #204a87;">u32</span> {
    a + (b <span style="color: #346604;">as</span> <span style="color: #204a87;">u32</span>)
}
<span style="color: #346604;">fn</span> <span style="color: #a40000;">main</span>() {
    <span style="color: #346604;">let</span> <span style="color: #b35000;">a</span> = 1;
    <span style="color: #346604;">let</span> <span style="color: #b35000;">b</span> = 2;
    <span style="color: #75507b;">assert_eq!</span>(sum(a,b),3);
    <span style="color: #346604;">let</span> <span style="color: #b35000;">elem</span> = 5u8;
    <span style="color: #346604;">let</span> <span style="color: #346604;">mut</span> <span style="color: #b35000;">vec</span> = <span style="color: #204a87;">Vec</span>::new();
    vec.push(elem);
    <span style="color: #75507b;">assert_eq!</span>(vec, [5]);
}
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org8b783dd" class="outline-3">
<h3 id="org8b783dd"><span class="section-number-3">3.3</span> 泛型（Generic）</h3>
<div class="outline-text-3" id="text-3-3">
<p>
泛型是一种参数化多态
</p>
</div>
<div id="outline-container-org20a9a75" class="outline-4">
<h4 id="org20a9a75"><span class="section-number-4">3.3.1</span> 泛型函数</h4>
<div class="outline-text-4" id="text-3-3-1">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #346604;">fn</span> <span style="color: #a40000;">foo</span>&lt;<span style="color: #204a87;">T</span>&gt;(<span style="color: #b35000;">x</span>:<span style="color: #204a87;">T</span>) -&gt; <span style="color: #204a87;">T</span> {
    <span style="color: #346604;">return</span> x;
}
<span style="color: #346604;">fn</span> <span style="color: #a40000;">main</span>() {
    <span style="color: #75507b;">assert_eq!</span>(foo(1),1);
    <span style="color: #75507b;">assert_eq!</span>(foo(<span style="color: #5c3566;">"hello"</span>),<span style="color: #5c3566;">"hello"</span>);
}
</pre>
</div>

<p>
编译期单态化的泛型函数
</p>
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #346604;">fn</span> <span style="color: #a40000;">foo_1</span>(<span style="color: #b35000;">x</span>: <span style="color: #204a87;">i32</span>) -&gt; <span style="color: #204a87;">i32</span> {
    <span style="color: #346604;">return</span> x;
}

<span style="color: #346604;">fn</span> <span style="color: #a40000;">foo_2</span>(<span style="color: #b35000;">x</span>: &amp;'<span style="color: #346604;">static</span> <span style="color: #204a87;">str</span>) -&gt; &amp;'<span style="color: #346604;">static</span> <span style="color: #204a87;">str</span> {
    <span style="color: #346604;">return</span> x;
}

<span style="color: #346604;">fn</span> <span style="color: #a40000;">main</span>() {
    foo_1(1);
    foo_2(<span style="color: #5c3566;">"2"</span>);
}
</pre>
</div>
<p>
单态化静态分发的好处是性能好，没有运行时开销；缺点是容易造成编译后生成的二进制文件膨胀。
</p>
</div>
</div>
<div id="outline-container-orgfe9cff2" class="outline-4">
<h4 id="orgfe9cff2"><span class="section-number-4">3.3.2</span> 泛型返回值自动推导</h4>
<div class="outline-text-4" id="text-3-3-2">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #75507b;">#[derive(Debug, PartialEq)]</span>
<span style="color: #346604;">struct</span> <span style="color: #204a87;">Foo</span>(<span style="color: #204a87;">i32</span>);
<span style="color: #75507b;">#[derive(Debug, PartialEq)]</span>
<span style="color: #346604;">struct</span> <span style="color: #204a87;">Bar</span>(<span style="color: #204a87;">i32</span>, <span style="color: #204a87;">i32</span>);
<span style="color: #346604;">trait</span> <span style="color: #204a87;">Inst</span> {
    <span style="color: #346604;">fn</span> <span style="color: #a40000;">new</span>(<span style="color: #b35000;">i</span>: <span style="color: #204a87;">i32</span>)-&gt; <span style="color: #204a87;">Self</span>;
}

<span style="color: #346604;">impl</span> <span style="color: #204a87;">Inst</span> <span style="color: #346604;">for</span> <span style="color: #204a87;">Foo</span> {
    <span style="color: #346604;">fn</span> <span style="color: #a40000;">new</span>(<span style="color: #b35000;">i</span>: <span style="color: #204a87;">i32</span>) -&gt; <span style="color: #204a87;">Foo</span> {
        <span style="color: #204a87;">Foo</span>(i)
    }
}
<span style="color: #346604;">impl</span> <span style="color: #204a87;">Inst</span> <span style="color: #346604;">for</span> <span style="color: #204a87;">Bar</span> {
    <span style="color: #346604;">fn</span> <span style="color: #a40000;">new</span>(<span style="color: #b35000;">i</span>: <span style="color: #204a87;">i32</span>) -&gt; <span style="color: #204a87;">Bar</span> {
        <span style="color: #204a87;">Bar</span>(i, i+10)
    }
}
<span style="color: #346604;">fn</span> <span style="color: #a40000;">foobar</span>&lt;<span style="color: #b35000;">T</span>: <span style="color: #204a87;">Inst</span>&gt;(<span style="color: #b35000;">i</span>: <span style="color: #204a87;">i32</span>) -&gt; <span style="color: #204a87;">T</span>{
    <span style="color: #204a87;">T</span>::new(i)
}
<span style="color: #346604;">fn</span> <span style="color: #a40000;">main</span>() {
    <span style="color: #346604;">let</span> <span style="color: #b35000;">f</span>: <span style="color: #204a87;">Foo</span> = foobar(10);
    <span style="color: #75507b;">assert_eq!</span>(f, <span style="color: #204a87;">Foo</span>(10));
    <span style="color: #346604;">let</span> <span style="color: #b35000;">b</span>: <span style="color: #204a87;">Bar</span> = foobar(20);
    <span style="color: #75507b;">assert_eq!</span>(b, <span style="color: #204a87;">Bar</span>(20, 30));
}
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org0d03fb1" class="outline-3">
<h3 id="org0d03fb1"><span class="section-number-3">3.4</span> 深入trait</h3>
<div class="outline-text-3" id="text-3-4">
<p>
从类型系统的角度来说，trait是Rust对Ad-hoc多态的支持。
</p>

<p>
从语义上来说，trait是在行为上对类型的约束，这种约束可以让trait有如下4种用法：
</p>
<ul class="org-ul">
<li>接口抽象</li>
<li>泛型约束</li>
<li>抽象类型</li>
<li>标签trait</li>
</ul>
</div>
